---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCAggregateIterator.CurrentObject
source: html/772e625f-b67b-114a-f81e-36351f3ed97d.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregateIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```